Terraform Plan:
```aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_ebs_volume.gp3_volume_wazuh-indexer: Refreshing state... [id=vol-0fef670bbba91e14b]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240126004538603800000002]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240126004538591100000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
module.ec2_wazuh-indexer-01.aws_instance.this[0]: Refreshing state... [id=i-020ee2d56341b4bd9]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/898b0fe46c93438a]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_lb_listener.wazuh_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/898b0fe46c93438a/c7f474bd17f48c45]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/898b0fe46c93438a/f7a577f38c791d50]
aws_volume_attachment.ebs_att_wazuh-indexer-01: Refreshing state... [id=vai-2087835945]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e-20240127050235591300000001]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a-20240126003225435200000001]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ebs_volume.gp3_volume_wazuh-indexer will be updated in-place
  ~ resource "aws_ebs_volume" "gp3_volume_wazuh-indexer" {
        id                   = "vol-0fef670bbba91e14b"
      ~ tags                 = {
          ~ "Name" = "wazuh-indexer-01" -> "wazuh_indexer_01_persistence"
        }
      ~ tags_all             = {
          ~ "Name" = "wazuh-indexer-01" -> "wazuh_indexer_01_persistence"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_lb.soc_alb must be replaced
-/+ resource "aws_lb" "soc_alb" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/898b0fe46c93438a" -> (known after apply)
      ~ arn_suffix                                                   = "app/grafana-alb/898b0fe46c93438a" -> (known after apply)
      ~ dns_name                                                     = "grafana-alb-812462479.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/898b0fe46c93438a" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "grafana-alb" -> "soc-alb" # forces replacement
      + name_prefix                                                  = (known after apply)
      - tags                                                         = {} -> null
      ~ tags_all                                                     = {} -> (known after apply)
      ~ vpc_id                                                       = "vpc-03e05ec4d7ef91467" -> (known after apply)
      ~ zone_id                                                      = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (14 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-03d02c1913e5a7e17" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0aaf48c52ec90dd1a" -> null
        }
    }

  # aws_lb_listener.grafana_listener must be replaced
-/+ resource "aws_lb_listener" "grafana_listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/898b0fe46c93438a/f7a577f38c791d50" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/898b0fe46c93438a/f7a577f38c791d50" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/898b0fe46c93438a" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.wazuh_listener must be replaced
-/+ resource "aws_lb_listener" "wazuh_listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/898b0fe46c93438a/c7f474bd17f48c45" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/898b0fe46c93438a/c7f474bd17f48c45" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/898b0fe46c93438a" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```